Revit 2026 API

# FabricationPartConnectAndCouple Method

---

Makes a connection between the specified connectors and adds coupling if necessary.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ConnectAndCouple(
	Document document,
	Connector connector,
	Connector toConnector
)
```
```vb
Public Shared Function ConnectAndCouple (
	document As Document,
	connector As Connector,
	toConnector As Connector
) As Boolean
```
```cpp
public:
static bool ConnectAndCouple(
	Document^ document,
	Connector^ connector,
	Connector^ toConnector
)
```
```fsharp
static member ConnectAndCouple :
        document : Document *
        connector : Connector *
        toConnector : Connector -> bool
```

#### Parameters

document Document
     The document.
connector Connector
     The connector of the fabrication part.
toConnector Connector
     The connector of the fabrication part or family to connect to.

#### Return Value

Boolean True if connection succeeded, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The connector does not belong to a fabrication part. -or- The fabrication part connectors are not aligned, call AlignPartByConnectors to align them. |
| ArgumentNullException | A non-optional argument was null |

This function does not place and align the fabrication part. Call AlignPartByConnectors before connecting.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace